Repository: SamXCode73/LiteClinic
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ar, fr_fr

# SPNV_Logs.ToolTipService.ToolTip
source: View system logs and activity history
ar: عرض سجلات النظام وسجل النشاط
fr_fr: Afficher les journaux système et l'historique des activités

# UrLp_AddNewRole.Text
source: Add New Role
ar: إضافة دور جديد (صلاحية/وظيفة)
fr_fr: Ajouter un nouveau rôle

# UrLp_RoleNameLabel.Text
source: Role Name:
ar: اسم الصلاحية / الوظيفة:
fr_fr: Nom du rôle :

# UrLp_RoleNameBox.PlaceholderText
source: Enter New Role Name
ar: أدخل اسم الدور الجديد
fr_fr: Entrez le nouveau nom du rôle

# UrLp_PermissionsLabel.Text
source: Permissions:
ar: الصلاحيات:
fr_fr: Autorisations :

# UrLp_CanManageDoctors.Content
source: Can Manage Doctors
ar: يمكنه إدارة الأطباء
fr_fr: Peut gérer les médecins

# UrLp_CanManageUsers.Content
source: Can Manage Users
ar: يمكنه إدارة المستخدمين
fr_fr: Peut gérer les utilisateurs

# UrLp_UserAdd.Content
source: Add
ar: إضافة
fr_fr: Ajouter

# UrLp_UserEdit.Content
source: Edit
ar: تعديل
fr_fr: Modifier

# UrLp_UserDeactivate.Content
source: Deactivate
ar: تعطيل
fr_fr: Désactiver

# UrLp_CanAccessDashboard.Content
source: Can Access Dashboard
ar: يمكنه الوصول إلى لوحة التحكم
fr_fr: Peut accéder au tableau de bord

# UrLp_CanViewAppointments.Content
source: Can View Appointments
ar: يمكنه عرض المواعيد
fr_fr: Peut consulter les rendez-vous

# UrLp_CanManageRecords.Content
source: Can Manage Records
ar: يمكنه إدارة السجلات
fr_fr: Peut gérer les dossiers

# UrLp_CanEditRecords.Content
source: Can Edit Records
ar: يمكنه تعديل السجلات
fr_fr: Peut modifier les dossiers

# UrLp_Deactivated.Content
source: Deactivated
ar: معطل
fr_fr: Désactivé

# UrLp_ReportSectionLabel.Text
source: Report section:
ar: قسم التقارير:
fr_fr: Section des rapports :

# UrLp_CanManageReports.Content
source: Can Manage Reports
ar: يمكنه إدارة التقارير
fr_fr: Peut gérer les rapports

# UrLp_CanViewReports.Content
source: Can View Reports
ar: يمكنه عرض التقارير
fr_fr: Peut consulter les rapports

# UrLp_SettingsLabel.Text
source: Settings
ar: الإعدادات
fr_fr: Paramètres

# UrLp_CanManageSettings.Content
source: Can Manage Settings
ar: يمكنه إدارة الإعدادات
fr_fr: Peut gérer les paramètres

# UrLp_CanViewSettings.Content
source: Can View Settings
ar: يمكنه عرض الإعدادات
fr_fr: Peut consulter les paramètres

# UrLp_AddButton.Content
source: Add
ar: إضافة
fr_fr: Ajouter

# UrLp_EditButton.Content
source: Edit
ar: تعديل
fr_fr: Modifier

# UrLp_DeactivateButton.Content
source: Deactivate
ar: تعطيل
fr_fr: Désactiver

# UrLp_ClearButton.Content
source: Clear
ar: مسح
fr_fr: Effacer

# UrLp_BackToUserPageButton.Content
source: Back to User Page
ar: العودة إلى صفحة المستخدم
fr_fr: Retour à la page utilisateur

# UrLp_ExistingRolesLabel.Text
source: Existing Roles
ar: قائمة الوظائف أو الصلاحيات
fr_fr: Rôles existants

# UrLp_HeaderId.Text
source: ID
ar: المعرف

# UrLp_HeaderRoleName.Text
source: Role Name
ar: الصلاحية / الوظيفة
fr_fr: Nom du rôle

# UrLp_HeaderPermissions.Text
source: Permissions
ar: الصلاحيات
fr_fr: Autorisations

# UrLp_AddShortcut.Text
source: Add = F1
ar: إضافة = F1
fr_fr: Ajouter = F1

# UrLp_EditShortcut.Text
source: Edit = F2
ar: تعديل = F2
fr_fr: Modifier = F2

# UrLp_DeactivateShortcut.Text
source: Deactivate = F3
ar: تعطيل = F3
fr_fr: Désactiver = F3

# UrLp_ClearShortcut.Text
source: Clear = F4
ar: مسح = F4
fr_fr: Effacer = F4

# UrLp_DeactivatedUserLabel.Text
source: Deactivated User =
ar: المستخدم المعطل =
fr_fr: Utilisateur désactivé =

# UrLp_BackShortcut.Text
source: Back to User Page = F5
ar: العودة إلى صفحة المستخدم = F5
fr_fr: Retour à la page utilisateur = F5

# UrLp_RolesHeader.Text
source: ID
ar: المعرف

# UrLp_CanViewSettings.ToolTipService.ToolTip
source: Only View, cannot change
ar: عرض فقط، لا يمكن التغيير
fr_fr: Seulement consulter, ne peut pas modifier

# UrLp_CanManageSettings.ToolTipService.ToolTip
source: View and change Settings
ar: عرض وتغيير الإعدادات
fr_fr: Consulter et modifier les paramètres

# UrLp_CanManageRecords.ToolTipService.ToolTip
source: Manage Record Only: ADD
ar: إدارة السجل فقط: إضافة
fr_fr: Gérer uniquement les dossiers : AJOUTER

# UrLp_CanEditRecords.ToolTipService.ToolTip
source: Manage Records: EDIT/DEACTIVATE
ar: إدارة السجلات: تعديل/تعطيل
fr_fr: Gérer les dossiers : MODIFIER/DÉSACTIVER

# UrLp_StatusMessageFormat
source: Loaded {0} Roles.
ar: تم تحميل {0} دور.
fr_fr: {0} rôles chargés.

# UrLp_NoPrivilegedRoleMessage
source: You do not have permission to create a fully privileged role.
ar: ليس لديك إذن لإنشاء دور كامل الصلاحيات.
fr_fr: Vous n’avez pas l’autorisation de créer un rôle entièrement privilégié.

# UrLp_AdminManageUsersMessage
source: Only Admin can manage who can manage users.
ar: فقط المسؤول يمكنه إدارة من يمكنه إدارة المستخدمين.
fr_fr: Seul l’administrateur peut gérer qui peut gérer les utilisateurs.

# UrLp_RoleNameRequiredMessage
source: Role name is required.
ar: اسم الدور مطلوب.
fr_fr: Le nom du rôle est requis.

# UrLp_RoleAddedMessage
source: Role added successfully.
ar: تمت إضافة الدور بنجاح.
fr_fr: Rôle ajouté avec succès.

# UrLp_NoRoleSelectedtoUpdateMessage
source: No role selected to update.
ar: لم يتم تحديد أي دور للتحديث.
fr_fr: Aucun rôle sélectionné pour la mise à jour.

# UrLp_RoleUpdatedMessage
source: Role updated successfully.
ar: تم تحديث الدور بنجاح.
fr_fr: Rôle mis à jour avec succès.

# UrLp_AdminDeactivateRoleMessage
source: Only Admin can deactivate Admin's role.
ar: فقط المسؤول يمكنه تعطيل دور المسؤول.
fr_fr: Seul l’administrateur peut désactiver le rôle d’un administrateur.

# UrLp_NoRoleSelectedMessage
source: No role selected.
ar: لم يتم تحديد أي دور.
fr_fr: Aucun rôle sélectionné.

# UrLp_RoleActivatedMessage
source: Role activated successfully.
ar: تم تفعيل الدور بنجاح.
fr_fr: Rôle activé avec succès.

# UrLp_RoleDeactivatedMessage
source: Role deactivated successfully.
ar: تم تعطيل الدور بنجاح.
fr_fr: Rôle désactivé avec succès.

# UrLp_AdminEditRoleMessage
source: Only Admin can edit Admin's role.
ar: فقط المسؤول يمكنه تعديل دور المسؤول.
fr_fr: Seul l’administrateur peut modifier le rôle d’un administrateur.

# Usrp_UserManager.Text
source: User Manager
ar: إدارة المستخدمين
fr_fr: Gestionnaire d’utilisateurs

# Usrp_UsernameBox.Header
source: Username
ar: اسم المستخدم
fr_fr: Nom d’utilisateur

# Usrp_PasswordBox.Header
source: Password
ar: كلمة المرور
fr_fr: Mot de passe

# Usrp_ConfirmPasswordBox.Header
source: Confirm Password
ar: تأكيد كلمة المرور
fr_fr: Confirmer le mot de passe

# Usrp_FullNameBox.Header
source: Full Name
ar: الاسم الكامل
fr_fr: Nom complet

# Usrp_EmailBox.Header
source: Email
ar: البريد الإلكتروني

# Usrp_PhoneBox.Header
source: Phone Number
ar: رقم الهاتف
fr_fr: Numéro de téléphone

# Usrp_LandLineBox.Header
source: Landline Number
ar: رقم الهاتف الأرضي
fr_fr: Numéro de ligne fixe

# Usrp_LanguageBox.Header
source: Language
ar: اللغة
fr_fr: Langue

# Usrp_Language_enUS.Content
source: English (US)
ar: الإنجليزية (أمريكا)
fr_fr: Anglais (US)

# Usrp_Language_ar.Content
source: Arabic
ar: العربية
fr_fr: Arabe

# Usrp_PermissionsLabel.Text
source: Permissions
ar: الصلاحيات
fr_fr: Autorisations

# Usrp_RoleNameBox.Header
source: Select Role
ar: اختر الدور
fr_fr: Sélectionner un rôle

# Usrp_IsActiveCheckBox.Content
source: Is Active
ar: نشط
fr_fr: Actif

# Usrp_AddButton.Content
source: Add
ar: إضافة
fr_fr: Ajouter

# Usrp_AddButton.ToolTipService.ToolTip
source: Save/F1
ar: حفظ/F1
fr_fr: Enregistrer/F1

# Usrp_EditButton.Content
source: Edit
ar: تعديل
fr_fr: Modifier

# Usrp_EditButton.ToolTipService.ToolTip
source: Update/F2
ar: تحديث/F2
fr_fr: Mettre à jour/F2

# Usrp_DeactivateButton.Content
source: Deactivate
ar: إلغاء التفعيل
fr_fr: Désactiver

# Usrp_DeactivateButton.ToolTipService.ToolTip
source: Deactivate/F3
ar: إلغاء التفعيل/F3
fr_fr: Désactiver/F3

# Usrp_ClearButton.Content
source: Clear
ar: مسح
fr_fr: Effacer

# Usrp_ClearButton.ToolTipService.ToolTip
source: Clear Data (refresh)/F4
ar: مسح البيانات (تحديث)/F4
fr_fr: Effacer les données (rafraîchir)/F4

# Usrp_UsersManagerListLabel.Text
source: Users Manager List
ar: قائمة إدارة المستخدمين
fr_fr: Liste des utilisateurs

# Usrp_AddUserRoleButton.Content
source: Add User's Role
ar: إضافة وظيفة / صلاحية جديدة
fr_fr: Ajouter un rôle utilisateur

# Usrp_Column_Auto.Header
source: Auto
ar: تلقائي

# Usrp_Column_UserId.Header
source: User ID
ar: معرّف المستخدم
fr_fr: ID utilisateur

# Usrp_Column_Username.Header
source: Username
ar: اسم المستخدم
fr_fr: Nom d’utilisateur

# Usrp_Column_FullName.Header
source: Full Name
ar: الاسم الكامل
fr_fr: Nom complet

# Usrp_Column_Email.Header
source: Email
ar: البريد الإلكتروني

# Usrp_Column_PhoneNumber.Header
source: Mobile Phone
ar: الهاتف المحمول
fr_fr: Téléphone portable

# Usrp_Column_LandLineNumber.Header
source: Land Line Phone
ar: الهاتف الأرضي
fr_fr: Téléphone fixe

# Usrp_Column_Language.Header
source: Language
ar: اللغة
fr_fr: Langue

# Usrp_Column_Role.Header
source: Role
ar: الدور
fr_fr: Rôle

# Usrp_Column_RoleName.Header
source: Role Name
ar: اسم الدور
fr_fr: Nom du rôle

# Usrp_Column_IsActive.Header
source: Active
ar: نشط
fr_fr: Actif

# Usrp_Cell_IsActiveCheckBox.Content
source: Active
ar: نشط
fr_fr: Actif

# Usrp_Cell_UserAutoId.Header
source: User ID
ar: معرّف المستخدم
fr_fr: ID utilisateur

# Usrp_UsernameBox.PlaceholderText
source: Enter New Username
ar: أدخل اسم مستخدم جديد
fr_fr: Entrez un nouveau nom d’utilisateur

# Usrp_PasswordBox.PlaceholderText
source: Enter Password
ar: أدخل كلمة المرور
fr_fr: Entrez le mot de passe

# Usrp_ConfirmPasswordBox.PlaceholderText
source: Confirm Password
ar: أدخل تأكيد كلمة المرور
fr_fr: Confirmez le mot de passe

# LoadedUsersMessage
source: {0} users loaded successfully.
ar: تم تحميل {0} مستخدم بنجاح.
fr_fr: {0} utilisateurs chargés avec succès.

# CopyRightMessage
source: 2025 - {0} LiteClinic Version {1} © Developed by Samer Hmouda. All rights reserved.
ar: 2025 - {0} لايت كلينك إصدار {1} © جميع الحقوق محفوظة.
fr_fr: 2025 - {0} LiteClinic Version {1} © Développé par Samer Hmouda. Tous droits réservés.

# DDP_DoctorDirectory.Text
source: Doctor Directory
ar: دليل الأطباء
fr_fr: Annuaire des médecins

# DDP_SearchBox.PlaceholderText
source: Search by name or specialty
ar: ابحث بالاسم أو التخصص
fr_fr: Rechercher par nom ou spécialité

# DDP_SpecialtyComboBox.PlaceholderText
source: Specialty
ar: التخصص
fr_fr: Spécialité

# DDP_TimeSlots.Text
source: Time Slots:
ar: الفترات الزمنية:
fr_fr: Créneaux horaires :

# DDP_MorningToggle.Content
source: Morning
ar: الصباح
fr_fr: Matin

# DDP_AfternoonToggle.Content
source: Afternoon
ar: بعد الظهر
fr_fr: Après-midi

# DDP_EveningToggle.Content
source: Evening
ar: المساء
fr_fr: Soir

# DDP_AvailableTodayToggle.Content
source: Available Today
ar: متاح اليوم
fr_fr: Disponible aujourd'hui

# DDP_ViewProfileButton.Content
source: View Profile
ar: عرض الملف الشخصي
fr_fr: Voir le profil

# DDP_BookAppointmentButton.Content
source: Book Appointment
ar: حجز موعد
fr_fr: Réserver un rendez-vous

# DDP_RefreshButton.Content
source: Refresh
ar: تحديث
fr_fr: Actualiser

# DDP_TodayDoctorsLegend.Text
source: Today’s Doctors
ar: الأطباء المتاحون اليوم
fr_fr: Médecins d’aujourd’hui

# DDP_FilteredDoctorsLegend.Text
source: Filtered Doctors
ar: الأطباء حسب التصفية
fr_fr: Médecins filtrés

# DoctorsScheduled.Text
source: Doctors/Scheduled
ar: الأطباء/المجدولون
fr_fr: Médecins/Planifiés

# DrServiceIdsPage.Text
source: Doctors/Service ID
ar: الأطباء/معرّف الخدمة
fr_fr: Médecins/ID de service

# DashboardMenu.Text
source: Dashboard
ar: لوحة التحكم
fr_fr: Tableau de bord

# Dashboard.Text
source: Dashboard/Clinic Calendar
ar: لوحة التحكم/جدول العيادة
fr_fr: Tableau de bord/Calendrier de la clinique
